"%1$@ %2$@ has been downloaded and is ready to use! Would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ on ladattu ja valmis käytettäväksi! Haluatko asentaa sen ja käynnistää %1$@ -sovelluksen uudelleen?";
"%1$@ can't be updated when it's running from a read-only volume like a disk image or an optical drive. Move %1$@ to your Applications folder, relaunch it from there, and try again." = "%1$@ -sovellusta ei voida päivittää, kun sitä käytetään kirjoitussuojatusta asemasta kuten levyvedoksesta tai optisesta asemasta. Siirrä %1$@ Ohjelmat-kansioon, käynnistä se ja yritä uudelleen.";
"%@ %@ is currently the newest version available." = "%1$@ %2$@ on tällä hetkellä uusin saatavilla oleva versio.";
"%@ %@ is now available--you have %@. Would you like to download it now?" = "%1$@ %2$@ on nyt saatavilla - käytössäsi on %3$@. Haluatko ladata sen nyt?";
"%@ downloaded" = "%@ ladattu";
"%@ of %@" = "%1$@ %2$@:sta";
"A new version of %@ is available!" = "Uusi versio %@ -sovelluksesta on saatavilla!";
"A new version of %@ is ready to install!" = "Uusi versio %@ -sovelluksesta on valmis asennettavaksi!";
"An error occurred in retrieving update information. Please try again later." = "Päivitystietojen hakemisen aikana ilmeni virhe. Yritä myöhemmin uudelleen.";
"An error occurred while downloading the update. Please try again later." = "Päivityksen lataamisen aikana ilmeni virhe. Yritä myöhemmin uudelleen.";
"An error occurred while extracting the archive. Please try again later." = "Arkiston purkamisen aikana ilmeni virhe. Yritä myöhemmin uudelleen.";
"An error occurred while installing the update. Please try again later." = "Päivityksen asennuksen aikana ilmeni virhe. Yritä myöhemmin uudelleen.";
"An error occurred while parsing the update feed." = "Päivityssyötteen jäsennyksen aikana ilmeni virhe.";
"An error occurred while relaunching %1$@, but the new version will be available next time you run %1$@." = "%1$@ -sovelluksen uudelleenkäynnistyksen aikana ilmeni virhe, mutta uusi versio on saatavilla, kun käytät %1$@ -sovellusta seuraavan kerran.";
"B" = "B";
"Cancel" = "Peruuta";
"Cancel Update" = "Peruuta päivitys";
"Checking for updates..." = "Etsitään päivityksiä…";
"Downloading update..." = "Ladataan päivityksiä…";
"Extracting update..." = "Puretaan päivityksiä…";
"GB" = "GB";
"Install and Relaunch" = "Asenna ja käynnistä uudelleen";
"Installing update..." = "Päivitystä asennetaan…";
"KB" = "KB";
"MB" = "MB";
"OK" = "OK";
"Ready to Install" = "Valmis asennettavaksi";
"Should %1$@ automatically check for updates? You can always check for updates manually from the %1$@ menu." = "Haluatko, että %1$@ etsii päivityksiä automaattisesti? Voit etsiä päivityksiä manuaalisesti milloin tahansa %1$@ -valikosta.";
"Update Error!" = "Päivitysvirhe!";
"Updating %@" = "Päivitetään %@ -sovellusta";
"You already have the newest version of %@." = "Käytössäsi on jo %@ -sovelluksen uusin versio.";
"You're up-to-date!" = "Ohjelmistosi on ajan tasalla!";
"Learn More..." = "Lisätietoja…";